In [3]:
import sqlite3

Creamos una bace de datos

In [4]:
connection = sqlite3.connect("SaludAlumnos.db")

en SQL se har√≠a tecleando "CREATE DATABASE company;"

In [5]:
cursor = connection.cursor()

In [10]:
#ingresar comando sql
sql_command = """
CREATE TABLE grupo1A ( 
Nolista INTEGER PRIMARY KEY, 
fname VARCHAR(20), 
lname VARCHAR(30), 
gender CHAR(1), 
Peso FLOAT,
Altura FLOAT);"""
#ejecutar el comando en sql
cursor.execute(sql_command)

In [9]:
# delete 
cursor.execute("""DROP TABLE grupo1A;""")

In [11]:
sql_command = """INSERT INTO grupo1A (Nolista, fname, lname, gender, Peso, Altura)
                 VALUES (1, "Juanito", "Perez", "m", "45", "1.65");"""

cursor.execute(sql_command)

In [12]:
sql_command = """INSERT INTO grupo1A (Nolista, fname, lname, gender, Peso, Altura)
                 VALUES (2, "Rosita", "Luna", "f", "50", "1.65");"""

cursor.execute(sql_command)

In [13]:
# never forget this, if you want the changes to be saved:
connection.commit()

connection.close()

In [14]:
conn = sqlite3.connect("SaludAlumnos.db")

In [15]:
cur = conn.cursor()

In [16]:
cur.execute("select * from grupo1A limit 2;")

In [17]:
results = cur.fetchall()
print(results)

[(1, 'Juanito', 'Perez', 'm', 45.0, 1.65), (2, 'Rosita', 'Luna', 'f', 50.0, 1.65)]

In [22]:
#ingresar comando sql
sql_command = """
CREATE TABLE grupo1B ( 
Nolista INTEGER PRIMARY KEY, 
fname VARCHAR(20), 
lname VARCHAR(30), 
gender CHAR(1), 
Peso FLOAT,
Altura FLOAT);"""
#ejecutar el comando en sql
cur.execute(sql_command)

In [21]:
cur.execute("""DROP TABLE grupo1B;""")

OperationalError: no such table: grupo1B

In [23]:
staff_data = [ (1, "Fabian", "Hernandez", "m", 19, 45),
               ("2", "Edgar", "Preciado", "m", "19", "56"),
               ("3", "Paloma", "Cimental", "f", "20", "27") ]
               
for p in staff_data:
    format_str = """INSERT INTO grupo1B (Nolista, fname, lname, gender, Peso, Altura)
    VALUES (NULL, "{first}", "{last}", "{gender}", "{Peso}", "{Altura}");"""

    sql_command = format_str.format(first=p[0], last=p[1], gender=p[2], Peso = p[3], Altura = p[4])
    cur.execute(sql_command)

In [24]:
conn.commit()

In [25]:
cur.execute("select * from grupo1B limit 4;")
results = cur.fetchall()
print(results)

[(1, '1', 'Fabian', 'Hernandez', 'm', 19.0), (2, '2', 'Edgar', 'Preciado', 'm', 19.0), (3, '3', 'Paloma', 'Cimental', 'f', 20.0)]

In [26]:
conn.close()

In [29]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("SaludAlumnos.db")
cur = conn.cursor()

In [30]:
df = pd.read_sql_query("select * from grupo1B limit 5;", conn)
df

   Nolista fname   lname     gender Peso  Altura
0        1     1  Fabian  Hernandez    m    19.0
1        2     2   Edgar   Preciado    m    19.0
2        3     3  Paloma   Cimental    f    20.0

In [31]:
df.describe()

       Nolista     Altura
count      3.0   3.000000
mean       2.0  19.333333
std        1.0   0.577350
min        1.0  19.000000
25%        1.5  19.000000
50%        2.0  19.000000
75%        2.5  19.500000
max        3.0  20.000000

In [45]:
sql_command = """
CREATE TABLE Maestros ( 
staff_number INTEGER PRIMARY KEY,
salario INTEGER,
fname VARCHAR(20), 
lname VARCHAR(30), 
gender CHAR(1), 
joining DATE,
birth_date DATE);"""
#ejecutar el comando en sql
cur.execute(sql_command)

In [44]:
cur.execute("""DROP TABLE Maestros;""")

In [46]:
staff_data = [ (2,5000, "Fabian", "Hernandez", "m", "1961-10-25"),
               (3,7000,"Edgar", "Preciado", "m", "1955-08-17"),
               (4,9000,"Paloma", "Cimental", "f", "1989-03-14")]
               
for p in staff_data:
    format_str = """INSERT INTO Maestros (staff_number,salario, fname, lname, gender, birth_date)
    VALUES ("{numero1}","{numero2}", "{first}", "{last}", "{gender}", "{birthdate}");"""

    sql_command = format_str.format(numero1=p[0],numero2=p[1],first=p[2], last=p[3], gender=p[4], birthdate = p[5])
    cur.execute(sql_command)

In [47]:
df1 = pd.read_sql_query("select * from Maestros limit 4;", conn)
df1

   staff_number  salario   fname      lname gender joining  birth_date
0             2     5000  Fabian  Hernandez      m    None  1961-10-25
1             3     7000   Edgar   Preciado      m    None  1955-08-17
2             4     9000  Paloma   Cimental      f    None  1989-03-14

In [48]:
df1.describe()

       staff_number  salario
count           3.0      3.0
mean            3.0   7000.0
std             1.0   2000.0
min             2.0   5000.0
25%             2.5   6000.0
50%             3.0   7000.0
75%             3.5   8000.0
max             4.0   9000.0

In [49]:
df1.salario

0    5000
1    7000
2    9000
Name: salario, dtype: int64

In [50]:
df1['salario'].value_counts()

7000    1
9000    1
5000    1
Name: salario, dtype: int64

In [51]:
conn.commit()
conn.close()